grevaillot/svd_tools/headers/STM32F3x4/hrtim_timb.h
/** @defgroup hrtim_timb_timbdier5 TIMBDIER5 TIMxDIER5
@{*/

/** HRTIM_TIMB_TIMBDIER5_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMB_TIMBDIER5_DLYPRTDE		(1 << 30)
/** HRTIM_TIMB_TIMBDIER5_RSTDE RSTDE **/
#define HRTIM_TIMB_TIMBDIER5_RSTDE		(1 << 29)
/** HRTIM_TIMB_TIMBDIER5_RSTx2DE RSTx2DE **/
#define HRTIM_TIMB_TIMBDIER5_RSTx2DE		(1 << 28)
/** HRTIM_TIMB_TIMBDIER5_SETx2DE SETx2DE **/
#define HRTIM_TIMB_TIMBDIER5_SETx2DE		(1 << 27)
/** HRTIM_TIMB_TIMBDIER5_RSTx1DE RSTx1DE **/
#define HRTIM_TIMB_TIMBDIER5_RSTx1DE		(1 << 26)
/** HRTIM_TIMB_TIMBDIER5_SET1xDE SET1xDE **/
#define HRTIM_TIMB_TIMBDIER5_SET1xDE		(1 << 25)
/** HRTIM_TIMB_TIMBDIER5_CPT2DE CPT2DE **/
#define HRTIM_TIMB_TIMBDIER5_CPT2DE		(1 << 24)
/** HRTIM_TIMB_TIMBDIER5_CPT1DE CPT1DE **/
#define HRTIM_TIMB_TIMBDIER5_CPT1DE		(1 << 23)
/** HRTIM_TIMB_TIMBDIER5_UPDDE UPDDE **/
#define HRTIM_TIMB_TIMBDIER5_UPDDE		(1 << 22)
/** HRTIM_TIMB_TIMBDIER5_REPDE REPDE **/
#define HRTIM_TIMB_TIMBDIER5_REPDE		(1 << 20)
/** HRTIM_TIMB_TIMBDIER5_CMP4DE CMP4DE **/
#define HRTIM_TIMB_TIMBDIER5_CMP4DE		(1 << 19)
/** HRTIM_TIMB_TIMBDIER5_CMP3DE CMP3DE **/
#define HRTIM_TIMB_TIMBDIER5_CMP3DE		(1 << 18)
/** HRTIM_TIMB_TIMBDIER5_CMP2DE CMP2DE **/
#define HRTIM_TIMB_TIMBDIER5_CMP2DE		(1 << 17)
/** HRTIM_TIMB_TIMBDIER5_CMP1DE CMP1DE **/
#define HRTIM_TIMB_TIMBDIER5_CMP1DE		(1 << 16)
/** HRTIM_TIMB_TIMBDIER5_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMB_TIMBDIER5_DLYPRTIE		(1 << 14)
/** HRTIM_TIMB_TIMBDIER5_RSTIE RSTIE **/
#define HRTIM_TIMB_TIMBDIER5_RSTIE		(1 << 13)
/** HRTIM_TIMB_TIMBDIER5_RSTx2IE RSTx2IE **/
#define HRTIM_TIMB_TIMBDIER5_RSTx2IE		(1 << 12)
/** HRTIM_TIMB_TIMBDIER5_SETx2IE SETx2IE **/
#define HRTIM_TIMB_TIMBDIER5_SETx2IE		(1 << 11)
/** HRTIM_TIMB_TIMBDIER5_RSTx1IE RSTx1IE **/
#define HRTIM_TIMB_TIMBDIER5_RSTx1IE		(1 << 10)
/** HRTIM_TIMB_TIMBDIER5_SET1xIE SET1xIE **/
#define HRTIM_TIMB_TIMBDIER5_SET1xIE		(1 << 9)
/** HRTIM_TIMB_TIMBDIER5_CPT2IE CPT2IE **/
#define HRTIM_TIMB_TIMBDIER5_CPT2IE		(1 << 8)
/** HRTIM_TIMB_TIMBDIER5_CPT1IE CPT1IE **/
#define HRTIM_TIMB_TIMBDIER5_CPT1IE		(1 << 7)
/** HRTIM_TIMB_TIMBDIER5_UPDIE UPDIE **/
#define HRTIM_TIMB_TIMBDIER5_UPDIE		(1 << 6)
/** HRTIM_TIMB_TIMBDIER5_REPIE REPIE **/
#define HRTIM_TIMB_TIMBDIER5_REPIE		(1 << 4)
/** HRTIM_TIMB_TIMBDIER5_CMP4IE CMP4IE **/
#define HRTIM_TIMB_TIMBDIER5_CMP4IE		(1 << 3)
/** HRTIM_TIMB_TIMBDIER5_CMP3IE CMP3IE **/
#define HRTIM_TIMB_TIMBDIER5_CMP3IE		(1 << 2)
/** HRTIM_TIMB_TIMBDIER5_CMP2IE CMP2IE **/
#define HRTIM_TIMB_TIMBDIER5_CMP2IE		(1 << 1)
/** HRTIM_TIMB_TIMBDIER5_CMP1IE CMP1IE **/
#define HRTIM_TIMB_TIMBDIER5_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_cntr CNTR Timerx Counter Register
@{*/


#define HRTIM_TIMB_CNTR_CNTx_SHIFT		0
#define HRTIM_TIMB_CNTR_CNTx_MASK		0xffff
/** @defgroup hrtim_timb_cntr_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_perbr PERBR Timerx Period Register
@{*/


#define HRTIM_TIMB_PERBR_PERx_SHIFT		0
#define HRTIM_TIMB_PERBR_PERx_MASK		0xffff
/** @defgroup hrtim_timb_perbr_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_repbr REPBR Timerx Repetition Register
@{*/


#define HRTIM_TIMB_REPBR_REPx_SHIFT		0
#define HRTIM_TIMB_REPBR_REPx_MASK		0xff
/** @defgroup hrtim_timb_repbr_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cmp1br CMP1BR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMB_CMP1BR_CMP1x_SHIFT		0
#define HRTIM_TIMB_CMP1BR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timb_cmp1br_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cmp1cbr CMP1CBR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMB_CMP1CBR_REPx_SHIFT		16
#define HRTIM_TIMB_CMP1CBR_REPx_MASK		0xff
/** @defgroup hrtim_timb_cmp1cbr_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMB_CMP1CBR_CMP1x_SHIFT		0
#define HRTIM_TIMB_CMP1CBR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timb_cmp1cbr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cmp2br CMP2BR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMB_CMP2BR_CMP2x_SHIFT		0
#define HRTIM_TIMB_CMP2BR_CMP2x_MASK		0xffff
/** @defgroup hrtim_timb_cmp2br_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cmp3br CMP3BR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMB_CMP3BR_CMP3x_SHIFT		0
#define HRTIM_TIMB_CMP3BR_CMP3x_MASK		0xffff
/** @defgroup hrtim_timb_cmp3br_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cmp4br CMP4BR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMB_CMP4BR_CMP4x_SHIFT		0
#define HRTIM_TIMB_CMP4BR_CMP4x_MASK		0xffff
/** @defgroup hrtim_timb_cmp4br_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cpt1br CPT1BR Timerx Capture 1 Register
@{*/


#define HRTIM_TIMB_CPT1BR_CPT1x_SHIFT		0
#define HRTIM_TIMB_CPT1BR_CPT1x_MASK		0xffff
/** @defgroup hrtim_timb_cpt1br_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cpt2br CPT2BR Timerx Capture 2 Register
@{*/


#define HRTIM_TIMB_CPT2BR_CPT2x_SHIFT		0
#define HRTIM_TIMB_CPT2BR_CPT2x_MASK		0xffff
/** @defgroup hrtim_timb_cpt2br_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_dtbr DTBR Timerx Deadtime Register
@{*/

/** HRTIM_TIMB_DTBR_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIMB_DTBR_DTFLKx		(1 << 31)
/** HRTIM_TIMB_DTBR_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIMB_DTBR_DTFSLKx		(1 << 30)
/** HRTIM_TIMB_DTBR_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIMB_DTBR_SDTFx		(1 << 25)

#define HRTIM_TIMB_DTBR_DTFx_SHIFT		16
#define HRTIM_TIMB_DTBR_DTFx_MASK		0x1ff
/** @defgroup hrtim_timb_dtbr_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIMB_DTBR_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIMB_DTBR_DTRLKx		(1 << 15)
/** HRTIM_TIMB_DTBR_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIMB_DTBR_DTRSLKx		(1 << 14)

#define HRTIM_TIMB_DTBR_DTPRSC_SHIFT		10
#define HRTIM_TIMB_DTBR_DTPRSC_MASK		0x07
/** @defgroup hrtim_timb_dtbr_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIMB_DTBR_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIMB_DTBR_SDTRx		(1 << 9)

#define HRTIM_TIMB_DTBR_DTRx_SHIFT		0
#define HRTIM_TIMB_DTBR_DTRx_MASK		0x1ff
/** @defgroup hrtim_timb_dtbr_dtrx DTRx Deadtime Rising value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_setb1r SETB1R Timerx Output1 Set Register
@{*/

/** HRTIM_TIMB_SETB1R_UPDATE Registers update (transfer preload to active) **/
#define HRTIM_TIMB_SETB1R_UPDATE		(1 << 31)
/** HRTIM_TIMB_SETB1R_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMB_SETB1R_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMB_SETB1R_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMB_SETB1R_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMB_SETB1R_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMB_SETB1R_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMB_SETB1R_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMB_SETB1R_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMB_SETB1R_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMB_SETB1R_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMB_SETB1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMB_SETB1R_TIMEVNT9 Timer Event 9 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMB_SETB1R_TIMEVNT8 Timer Event 8 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMB_SETB1R_TIMEVNT7 Timer Event 7 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMB_SETB1R_TIMEVNT6 Timer Event 6 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMB_SETB1R_TIMEVNT5 Timer Event 5 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMB_SETB1R_TIMEVNT4 Timer Event 4 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMB_SETB1R_TIMEVNT3 Timer Event 3 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMB_SETB1R_TIMEVNT2 Timer Event 2 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMB_SETB1R_TIMEVNT1 Timer Event 1 **/
#define HRTIM_TIMB_SETB1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMB_SETB1R_MSTCMP4 Master Compare 4 **/
#define HRTIM_TIMB_SETB1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMB_SETB1R_MSTCMP3 Master Compare 3 **/
#define HRTIM_TIMB_SETB1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMB_SETB1R_MSTCMP2 Master Compare 2 **/
#define HRTIM_TIMB_SETB1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMB_SETB1R_MSTCMP1 Master Compare 1 **/
#define HRTIM_TIMB_SETB1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMB_SETB1R_MSTPER Master Period **/
#define HRTIM_TIMB_SETB1R_MSTPER		(1 << 7)
/** HRTIM_TIMB_SETB1R_CMP4 Timer A compare 4 **/
#define HRTIM_TIMB_SETB1R_CMP4		(1 << 6)
/** HRTIM_TIMB_SETB1R_CMP3 Timer A compare 3 **/
#define HRTIM_TIMB_SETB1R_CMP3		(1 << 5)
/** HRTIM_TIMB_SETB1R_CMP2 Timer A compare 2 **/
#define HRTIM_TIMB_SETB1R_CMP2		(1 << 4)
/** HRTIM_TIMB_SETB1R_CMP1 Timer A compare 1 **/
#define HRTIM_TIMB_SETB1R_CMP1		(1 << 3)
/** HRTIM_TIMB_SETB1R_PER Timer A Period **/
#define HRTIM_TIMB_SETB1R_PER		(1 << 2)
/** HRTIM_TIMB_SETB1R_RESYNC Timer A resynchronizaton **/
#define HRTIM_TIMB_SETB1R_RESYNC		(1 << 1)
/** HRTIM_TIMB_SETB1R_SST Software Set trigger **/
#define HRTIM_TIMB_SETB1R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_rstb1r RSTB1R Timerx Output1 Reset Register
@{*/

