grevaillot/svd_tools/headers/STM32F3x4/hrtim_timb.h
/** HRTIM_TIMB_RSTB1R_UPDATE UPDATE **/
#define HRTIM_TIMB_RSTB1R_UPDATE		(1 << 31)
/** HRTIM_TIMB_RSTB1R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMB_RSTB1R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMB_RSTB1R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMB_RSTB1R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMB_RSTB1R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMB_RSTB1R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMB_RSTB1R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMB_RSTB1R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMB_RSTB1R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMB_RSTB1R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMB_RSTB1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMB_RSTB1R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMB_RSTB1R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMB_RSTB1R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMB_RSTB1R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMB_RSTB1R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMB_RSTB1R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMB_RSTB1R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMB_RSTB1R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMB_RSTB1R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMB_RSTB1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMB_RSTB1R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMB_RSTB1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMB_RSTB1R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMB_RSTB1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMB_RSTB1R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMB_RSTB1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMB_RSTB1R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMB_RSTB1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMB_RSTB1R_MSTPER MSTPER **/
#define HRTIM_TIMB_RSTB1R_MSTPER		(1 << 7)
/** HRTIM_TIMB_RSTB1R_CMP4 CMP4 **/
#define HRTIM_TIMB_RSTB1R_CMP4		(1 << 6)
/** HRTIM_TIMB_RSTB1R_CMP3 CMP3 **/
#define HRTIM_TIMB_RSTB1R_CMP3		(1 << 5)
/** HRTIM_TIMB_RSTB1R_CMP2 CMP2 **/
#define HRTIM_TIMB_RSTB1R_CMP2		(1 << 4)
/** HRTIM_TIMB_RSTB1R_CMP1 CMP1 **/
#define HRTIM_TIMB_RSTB1R_CMP1		(1 << 3)
/** HRTIM_TIMB_RSTB1R_PER PER **/
#define HRTIM_TIMB_RSTB1R_PER		(1 << 2)
/** HRTIM_TIMB_RSTB1R_RESYNC RESYNC **/
#define HRTIM_TIMB_RSTB1R_RESYNC		(1 << 1)
/** HRTIM_TIMB_RSTB1R_SRT SRT **/
#define HRTIM_TIMB_RSTB1R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_setb2r SETB2R Timerx Output2 Set Register
@{*/

/** HRTIM_TIMB_SETB2R_UPDATE UPDATE **/
#define HRTIM_TIMB_SETB2R_UPDATE		(1 << 31)
/** HRTIM_TIMB_SETB2R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMB_SETB2R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMB_SETB2R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMB_SETB2R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMB_SETB2R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMB_SETB2R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMB_SETB2R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMB_SETB2R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMB_SETB2R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMB_SETB2R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMB_SETB2R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMB_SETB2R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMB_SETB2R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMB_SETB2R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMB_SETB2R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMB_SETB2R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMB_SETB2R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMB_SETB2R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMB_SETB2R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMB_SETB2R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMB_SETB2R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMB_SETB2R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMB_SETB2R_MSTCMP4		(1 << 11)
/** HRTIM_TIMB_SETB2R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMB_SETB2R_MSTCMP3		(1 << 10)
/** HRTIM_TIMB_SETB2R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMB_SETB2R_MSTCMP2		(1 << 9)
/** HRTIM_TIMB_SETB2R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMB_SETB2R_MSTCMP1		(1 << 8)
/** HRTIM_TIMB_SETB2R_MSTPER MSTPER **/
#define HRTIM_TIMB_SETB2R_MSTPER		(1 << 7)
/** HRTIM_TIMB_SETB2R_CMP4 CMP4 **/
#define HRTIM_TIMB_SETB2R_CMP4		(1 << 6)
/** HRTIM_TIMB_SETB2R_CMP3 CMP3 **/
#define HRTIM_TIMB_SETB2R_CMP3		(1 << 5)
/** HRTIM_TIMB_SETB2R_CMP2 CMP2 **/
#define HRTIM_TIMB_SETB2R_CMP2		(1 << 4)
/** HRTIM_TIMB_SETB2R_CMP1 CMP1 **/
#define HRTIM_TIMB_SETB2R_CMP1		(1 << 3)
/** HRTIM_TIMB_SETB2R_PER PER **/
#define HRTIM_TIMB_SETB2R_PER		(1 << 2)
/** HRTIM_TIMB_SETB2R_RESYNC RESYNC **/
#define HRTIM_TIMB_SETB2R_RESYNC		(1 << 1)
/** HRTIM_TIMB_SETB2R_SST SST **/
#define HRTIM_TIMB_SETB2R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_rstb2r RSTB2R Timerx Output2 Reset Register
@{*/

/** HRTIM_TIMB_RSTB2R_UPDATE UPDATE **/
#define HRTIM_TIMB_RSTB2R_UPDATE		(1 << 31)
/** HRTIM_TIMB_RSTB2R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMB_RSTB2R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMB_RSTB2R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMB_RSTB2R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMB_RSTB2R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMB_RSTB2R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMB_RSTB2R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMB_RSTB2R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMB_RSTB2R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMB_RSTB2R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMB_RSTB2R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMB_RSTB2R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMB_RSTB2R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMB_RSTB2R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMB_RSTB2R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMB_RSTB2R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMB_RSTB2R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMB_RSTB2R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMB_RSTB2R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMB_RSTB2R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMB_RSTB2R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMB_RSTB2R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMB_RSTB2R_MSTCMP4		(1 << 11)
/** HRTIM_TIMB_RSTB2R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMB_RSTB2R_MSTCMP3		(1 << 10)
/** HRTIM_TIMB_RSTB2R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMB_RSTB2R_MSTCMP2		(1 << 9)
/** HRTIM_TIMB_RSTB2R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMB_RSTB2R_MSTCMP1		(1 << 8)
/** HRTIM_TIMB_RSTB2R_MSTPER MSTPER **/
#define HRTIM_TIMB_RSTB2R_MSTPER		(1 << 7)
/** HRTIM_TIMB_RSTB2R_CMP4 CMP4 **/
#define HRTIM_TIMB_RSTB2R_CMP4		(1 << 6)
/** HRTIM_TIMB_RSTB2R_CMP3 CMP3 **/
#define HRTIM_TIMB_RSTB2R_CMP3		(1 << 5)
/** HRTIM_TIMB_RSTB2R_CMP2 CMP2 **/
#define HRTIM_TIMB_RSTB2R_CMP2		(1 << 4)
/** HRTIM_TIMB_RSTB2R_CMP1 CMP1 **/
#define HRTIM_TIMB_RSTB2R_CMP1		(1 << 3)
/** HRTIM_TIMB_RSTB2R_PER PER **/
#define HRTIM_TIMB_RSTB2R_PER		(1 << 2)
/** HRTIM_TIMB_RSTB2R_RESYNC RESYNC **/
#define HRTIM_TIMB_RSTB2R_RESYNC		(1 << 1)
/** HRTIM_TIMB_RSTB2R_SRT SRT **/
#define HRTIM_TIMB_RSTB2R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_eefbr1 EEFBR1 Timerx External Event Filtering Register 1
@{*/


