grevaillot/svd_tools/headers/STM32F3x4/hrtim_timb.h
#define HRTIM_TIMB_EEFBR1_EE5FLTR_SHIFT		25
#define HRTIM_TIMB_EEFBR1_EE5FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr1_ee5fltr EE5FLTR External Event 5 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR1_EE5LTCH External Event 5 latch **/
#define HRTIM_TIMB_EEFBR1_EE5LTCH		(1 << 24)

#define HRTIM_TIMB_EEFBR1_EE4FLTR_SHIFT		19
#define HRTIM_TIMB_EEFBR1_EE4FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr1_ee4fltr EE4FLTR External Event 4 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR1_EE4LTCH External Event 4 latch **/
#define HRTIM_TIMB_EEFBR1_EE4LTCH		(1 << 18)

#define HRTIM_TIMB_EEFBR1_EE3FLTR_SHIFT		13
#define HRTIM_TIMB_EEFBR1_EE3FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr1_ee3fltr EE3FLTR External Event 3 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR1_EE3LTCH External Event 3 latch **/
#define HRTIM_TIMB_EEFBR1_EE3LTCH		(1 << 12)

#define HRTIM_TIMB_EEFBR1_EE2FLTR_SHIFT		7
#define HRTIM_TIMB_EEFBR1_EE2FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr1_ee2fltr EE2FLTR External Event 2 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR1_EE2LTCH External Event 2 latch **/
#define HRTIM_TIMB_EEFBR1_EE2LTCH		(1 << 6)

#define HRTIM_TIMB_EEFBR1_EE1FLTR_SHIFT		1
#define HRTIM_TIMB_EEFBR1_EE1FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr1_ee1fltr EE1FLTR External Event 1 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR1_EE1LTCH External Event 1 latch **/
#define HRTIM_TIMB_EEFBR1_EE1LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_eefbr2 EEFBR2 Timerx External Event Filtering Register 2
@{*/


#define HRTIM_TIMB_EEFBR2_EE10FLTR_SHIFT		25
#define HRTIM_TIMB_EEFBR2_EE10FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr2_ee10fltr EE10FLTR External Event 10 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR2_EE10LTCH External Event 10 latch **/
#define HRTIM_TIMB_EEFBR2_EE10LTCH		(1 << 24)

#define HRTIM_TIMB_EEFBR2_EE9FLTR_SHIFT		19
#define HRTIM_TIMB_EEFBR2_EE9FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr2_ee9fltr EE9FLTR External Event 9 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR2_EE9LTCH External Event 9 latch **/
#define HRTIM_TIMB_EEFBR2_EE9LTCH		(1 << 18)

#define HRTIM_TIMB_EEFBR2_EE8FLTR_SHIFT		13
#define HRTIM_TIMB_EEFBR2_EE8FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr2_ee8fltr EE8FLTR External Event 8 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR2_EE8LTCH External Event 8 latch **/
#define HRTIM_TIMB_EEFBR2_EE8LTCH		(1 << 12)

#define HRTIM_TIMB_EEFBR2_EE7FLTR_SHIFT		7
#define HRTIM_TIMB_EEFBR2_EE7FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr2_ee7fltr EE7FLTR External Event 7 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR2_EE7LTCH External Event 7 latch **/
#define HRTIM_TIMB_EEFBR2_EE7LTCH		(1 << 6)

#define HRTIM_TIMB_EEFBR2_EE6FLTR_SHIFT		1
#define HRTIM_TIMB_EEFBR2_EE6FLTR_MASK		0x0f
/** @defgroup hrtim_timb_eefbr2_ee6fltr EE6FLTR External Event 6 filter
@{*/
/**@}*/

/** HRTIM_TIMB_EEFBR2_EE6LTCH External Event 6 latch **/
#define HRTIM_TIMB_EEFBR2_EE6LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_rstbr RSTBR TimerA Reset Register
@{*/

/** HRTIM_TIMB_RSTBR_TIMECMP4 Timer E Compare 4 **/
#define HRTIM_TIMB_RSTBR_TIMECMP4		(1 << 30)
/** HRTIM_TIMB_RSTBR_TIMECMP2 Timer E Compare 2 **/
#define HRTIM_TIMB_RSTBR_TIMECMP2		(1 << 29)
/** HRTIM_TIMB_RSTBR_TIMECMP1 Timer E Compare 1 **/
#define HRTIM_TIMB_RSTBR_TIMECMP1		(1 << 28)
/** HRTIM_TIMB_RSTBR_TIMDCMP4 Timer D Compare 4 **/
#define HRTIM_TIMB_RSTBR_TIMDCMP4		(1 << 27)
/** HRTIM_TIMB_RSTBR_TIMDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMB_RSTBR_TIMDCMP2		(1 << 26)
/** HRTIM_TIMB_RSTBR_TIMDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMB_RSTBR_TIMDCMP1		(1 << 25)
/** HRTIM_TIMB_RSTBR_TIMCCMP4 Timer C Compare 4 **/
#define HRTIM_TIMB_RSTBR_TIMCCMP4		(1 << 24)
/** HRTIM_TIMB_RSTBR_TIMCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMB_RSTBR_TIMCCMP2		(1 << 23)
/** HRTIM_TIMB_RSTBR_TIMCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMB_RSTBR_TIMCCMP1		(1 << 22)
/** HRTIM_TIMB_RSTBR_TIMACMP4 Timer A Compare 4 **/
#define HRTIM_TIMB_RSTBR_TIMACMP4		(1 << 21)
/** HRTIM_TIMB_RSTBR_TIMACMP2 Timer A Compare 2 **/
#define HRTIM_TIMB_RSTBR_TIMACMP2		(1 << 20)
/** HRTIM_TIMB_RSTBR_TIMACMP1 Timer A Compare 1 **/
#define HRTIM_TIMB_RSTBR_TIMACMP1		(1 << 19)
/** HRTIM_TIMB_RSTBR_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT10		(1 << 18)
/** HRTIM_TIMB_RSTBR_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT9		(1 << 17)
/** HRTIM_TIMB_RSTBR_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT8		(1 << 16)
/** HRTIM_TIMB_RSTBR_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT7		(1 << 15)
/** HRTIM_TIMB_RSTBR_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT6		(1 << 14)
/** HRTIM_TIMB_RSTBR_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT5		(1 << 13)
/** HRTIM_TIMB_RSTBR_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT4		(1 << 12)
/** HRTIM_TIMB_RSTBR_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT3		(1 << 11)
/** HRTIM_TIMB_RSTBR_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT2		(1 << 10)
/** HRTIM_TIMB_RSTBR_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMB_RSTBR_EXTEVNT1		(1 << 9)
/** HRTIM_TIMB_RSTBR_MSTCMP4 Master compare 4 **/
#define HRTIM_TIMB_RSTBR_MSTCMP4		(1 << 8)
/** HRTIM_TIMB_RSTBR_MSTCMP3 Master compare 3 **/
#define HRTIM_TIMB_RSTBR_MSTCMP3		(1 << 7)
/** HRTIM_TIMB_RSTBR_MSTCMP2 Master compare 2 **/
#define HRTIM_TIMB_RSTBR_MSTCMP2		(1 << 6)
/** HRTIM_TIMB_RSTBR_MSTCMP1 Master compare 1 **/
#define HRTIM_TIMB_RSTBR_MSTCMP1		(1 << 5)
/** HRTIM_TIMB_RSTBR_MSTPER Master timer Period **/
#define HRTIM_TIMB_RSTBR_MSTPER		(1 << 4)
/** HRTIM_TIMB_RSTBR_CMP4 Timer A compare 4 reset **/
#define HRTIM_TIMB_RSTBR_CMP4		(1 << 3)
/** HRTIM_TIMB_RSTBR_CMP2 Timer A compare 2 reset **/
#define HRTIM_TIMB_RSTBR_CMP2		(1 << 2)
/** HRTIM_TIMB_RSTBR_UPDT Timer A Update reset **/
#define HRTIM_TIMB_RSTBR_UPDT		(1 << 1)

/**@}*/

/** @defgroup hrtim_timb_chpbr CHPBR Timerx Chopper Register
@{*/


#define HRTIM_TIMB_CHPBR_STRTPW_SHIFT		7
#define HRTIM_TIMB_CHPBR_STRTPW_MASK		0x0f
/** @defgroup hrtim_timb_chpbr_strtpw STRTPW STRTPW
@{*/
/**@}*/


