grevaillot/svd_tools/headers/STM32F3x4/hrtim_timb.h
#define HRTIM_TIMB_CHPBR_CHPDTY_SHIFT		4
#define HRTIM_TIMB_CHPBR_CHPDTY_MASK		0x07
/** @defgroup hrtim_timb_chpbr_chpdty CHPDTY Timerx chopper duty cycle value
@{*/
/**@}*/


#define HRTIM_TIMB_CHPBR_CHPFRQ_SHIFT		0
#define HRTIM_TIMB_CHPBR_CHPFRQ_MASK		0x0f
/** @defgroup hrtim_timb_chpbr_chpfrq CHPFRQ Timerx carrier frequency value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timb_cpt1bcr CPT1BCR Timerx Capture 2 Control Register
@{*/

/** HRTIM_TIMB_CPT1BCR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMB_CPT1BCR_TECMP2		(1 << 31)
/** HRTIM_TIMB_CPT1BCR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMB_CPT1BCR_TECMP1		(1 << 30)
/** HRTIM_TIMB_CPT1BCR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMB_CPT1BCR_TE1RST		(1 << 29)
/** HRTIM_TIMB_CPT1BCR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMB_CPT1BCR_TE1SET		(1 << 28)
/** HRTIM_TIMB_CPT1BCR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMB_CPT1BCR_TDCMP2		(1 << 27)
/** HRTIM_TIMB_CPT1BCR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMB_CPT1BCR_TDCMP1		(1 << 26)
/** HRTIM_TIMB_CPT1BCR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMB_CPT1BCR_TD1RST		(1 << 25)
/** HRTIM_TIMB_CPT1BCR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMB_CPT1BCR_TD1SET		(1 << 24)
/** HRTIM_TIMB_CPT1BCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMB_CPT1BCR_TCCMP2		(1 << 23)
/** HRTIM_TIMB_CPT1BCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMB_CPT1BCR_TCCMP1		(1 << 22)
/** HRTIM_TIMB_CPT1BCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMB_CPT1BCR_TC1RST		(1 << 21)
/** HRTIM_TIMB_CPT1BCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMB_CPT1BCR_TC1SET		(1 << 20)
/** HRTIM_TIMB_CPT1BCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMB_CPT1BCR_TACMP2		(1 << 15)
/** HRTIM_TIMB_CPT1BCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMB_CPT1BCR_TACMP1		(1 << 14)
/** HRTIM_TIMB_CPT1BCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMB_CPT1BCR_TA1RST		(1 << 13)
/** HRTIM_TIMB_CPT1BCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMB_CPT1BCR_TA1SET		(1 << 12)
/** HRTIM_TIMB_CPT1BCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMB_CPT1BCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMB_CPT1BCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMB_CPT1BCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMB_CPT1BCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMB_CPT1BCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMB_CPT1BCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMB_CPT1BCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMB_CPT1BCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMB_CPT1BCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMB_CPT1BCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMB_CPT1BCR_UDPCPT Update Capture **/
#define HRTIM_TIMB_CPT1BCR_UDPCPT		(1 << 1)
/** HRTIM_TIMB_CPT1BCR_SWCPT Software Capture **/
#define HRTIM_TIMB_CPT1BCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_cpt2bcr CPT2BCR CPT2xCR
@{*/

/** HRTIM_TIMB_CPT2BCR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMB_CPT2BCR_TECMP2		(1 << 31)
/** HRTIM_TIMB_CPT2BCR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMB_CPT2BCR_TECMP1		(1 << 30)
/** HRTIM_TIMB_CPT2BCR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMB_CPT2BCR_TE1RST		(1 << 29)
/** HRTIM_TIMB_CPT2BCR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMB_CPT2BCR_TE1SET		(1 << 28)
/** HRTIM_TIMB_CPT2BCR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMB_CPT2BCR_TDCMP2		(1 << 27)
/** HRTIM_TIMB_CPT2BCR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMB_CPT2BCR_TDCMP1		(1 << 26)
/** HRTIM_TIMB_CPT2BCR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMB_CPT2BCR_TD1RST		(1 << 25)
/** HRTIM_TIMB_CPT2BCR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMB_CPT2BCR_TD1SET		(1 << 24)
/** HRTIM_TIMB_CPT2BCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMB_CPT2BCR_TCCMP2		(1 << 23)
/** HRTIM_TIMB_CPT2BCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMB_CPT2BCR_TCCMP1		(1 << 22)
/** HRTIM_TIMB_CPT2BCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMB_CPT2BCR_TC1RST		(1 << 21)
/** HRTIM_TIMB_CPT2BCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMB_CPT2BCR_TC1SET		(1 << 20)
/** HRTIM_TIMB_CPT2BCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMB_CPT2BCR_TACMP2		(1 << 15)
/** HRTIM_TIMB_CPT2BCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMB_CPT2BCR_TACMP1		(1 << 14)
/** HRTIM_TIMB_CPT2BCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMB_CPT2BCR_TA1RST		(1 << 13)
/** HRTIM_TIMB_CPT2BCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMB_CPT2BCR_TA1SET		(1 << 12)
/** HRTIM_TIMB_CPT2BCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMB_CPT2BCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMB_CPT2BCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMB_CPT2BCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMB_CPT2BCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMB_CPT2BCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMB_CPT2BCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMB_CPT2BCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMB_CPT2BCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMB_CPT2BCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMB_CPT2BCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMB_CPT2BCR_UDPCPT Update Capture **/
#define HRTIM_TIMB_CPT2BCR_UDPCPT		(1 << 1)
/** HRTIM_TIMB_CPT2BCR_SWCPT Software Capture **/
#define HRTIM_TIMB_CPT2BCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timb_outbr OUTBR Timerx Output Register
@{*/

/** HRTIM_TIMB_OUTBR_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMB_OUTBR_DIDL2		(1 << 23)
/** HRTIM_TIMB_OUTBR_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIMB_OUTBR_CHP2		(1 << 22)

