grevaillot/svd_tools/headers/STM32F3x4/hrtim_timb.h
#define HRTIM_TIMB_OUTBR_FAULT2_SHIFT		20
#define HRTIM_TIMB_OUTBR_FAULT2_MASK		0x03
/** @defgroup hrtim_timb_outbr_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMB_OUTBR_IDLES2		(1 << 19)
/** HRTIM_TIMB_OUTBR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMB_OUTBR_IDLEM2		(1 << 18)
/** HRTIM_TIMB_OUTBR_POL2 Output 2 polarity **/
#define HRTIM_TIMB_OUTBR_POL2		(1 << 17)

#define HRTIM_TIMB_OUTBR_DLYPRT_SHIFT		10
#define HRTIM_TIMB_OUTBR_DLYPRT_MASK		0x07
/** @defgroup hrtim_timb_outbr_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMB_OUTBR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMB_OUTBR_DTEN Deadtime enable **/
#define HRTIM_TIMB_OUTBR_DTEN		(1 << 8)
/** HRTIM_TIMB_OUTBR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMB_OUTBR_DIDL1		(1 << 7)
/** HRTIM_TIMB_OUTBR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMB_OUTBR_CHP1		(1 << 6)

#define HRTIM_TIMB_OUTBR_FAULT1_SHIFT		4
#define HRTIM_TIMB_OUTBR_FAULT1_MASK		0x03
/** @defgroup hrtim_timb_outbr_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMB_OUTBR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMB_OUTBR_IDLES1		(1 << 3)
/** HRTIM_TIMB_OUTBR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMB_OUTBR_IDLEM1		(1 << 2)
/** HRTIM_TIMB_OUTBR_POL1 Output 1 polarity **/
#define HRTIM_TIMB_OUTBR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_timb_fltbr FLTBR Timerx Fault Register
@{*/

/** HRTIM_TIMB_FLTBR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMB_FLTBR_FLTLCK		(1 << 31)
/** HRTIM_TIMB_FLTBR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMB_FLTBR_FLT5EN		(1 << 4)
/** HRTIM_TIMB_FLTBR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMB_FLTBR_FLT4EN		(1 << 3)
/** HRTIM_TIMB_FLTBR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMB_FLTBR_FLT3EN		(1 << 2)
/** HRTIM_TIMB_FLTBR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMB_FLTBR_FLT2EN		(1 << 1)
/** HRTIM_TIMB_FLTBR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMB_FLTBR_FLT1EN		(1 << 0)

/**@}*/
